<a href="https://colab.research.google.com/github/kirtiman24/Titanic-Survivor-Prediction/blob/master/DT.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
data=pd.read_csv('Train.csv')

In [0]:
data.head(5)

   pclass  survived  ... body                          home.dest
0     3.0       0.0  ...  NaN                                NaN
1     2.0       0.0  ...  NaN                                NaN
2     2.0       1.0  ...  NaN                                NaN
3     3.0       1.0  ...  NaN  Strood, Kent, England Detroit, MI
4     3.0       1.0  ...  NaN                                NaN

[5 rows x 14 columns]

In [0]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   cabin      229 non-null    object
 10  embarked   1008 non-null   object
 11  boat       374 non-null    object
 12  body       98 non-null     float64
 13  home.dest  582 non-null    object
dtypes: float64(7), object(7)
memory usage: 110.5+ KB

In [0]:
coulmns_to_drop=["ticket","embarked","cabin","name","boat","body","home.dest"]
data_clean=data.drop(coulmns_to_drop,axis=1)

In [0]:
data_clean.head(5)

   pclass  survived     sex   age  sibsp  parch    fare
0     3.0       0.0  female   NaN    0.0    0.0   7.750
1     2.0       0.0    male  39.0    0.0    0.0  26.000
2     2.0       1.0  female  40.0    0.0    0.0  13.000
3     3.0       1.0  female  31.0    1.0    1.0  20.525
4     3.0       1.0  female   NaN    2.0    0.0  23.250

In [0]:
from sklearn.preprocessing import LabelEncoder

In [0]:
le=LabelEncoder()
data_clean["sex"]=le.fit_transform(data_clean["sex"])

In [0]:
data_clean.head(5)

   pclass  survived  sex   age  sibsp  parch    fare
0     3.0       0.0    0   NaN    0.0    0.0   7.750
1     2.0       0.0    1  39.0    0.0    0.0  26.000
2     2.0       1.0    0  40.0    0.0    0.0  13.000
3     3.0       1.0    0  31.0    1.0    1.0  20.525
4     3.0       1.0    0   NaN    2.0    0.0  23.250

In [0]:
data_clean=data_clean.fillna(data_clean["age"].mean())

In [0]:
data_clean.head(5)

   pclass  survived  sex        age  sibsp  parch    fare
0     3.0       0.0    0  29.838978    0.0    0.0   7.750
1     2.0       0.0    1  39.000000    0.0    0.0  26.000
2     2.0       1.0    0  40.000000    0.0    0.0  13.000
3     3.0       1.0    0  31.000000    1.0    1.0  20.525
4     3.0       1.0    0  29.838978    2.0    0.0  23.250

In [0]:
input_cols=["pclass","sex","age","sibsp","parch","fare"]
output_cols=["survived"]

In [0]:
X=data_clean[input_cols]
Y=data_clean[output_cols]

In [0]:
print(X.shape,Y.shape)

(1009, 6) (1009, 1)

In [0]:
from sklearn.tree import DecisionTreeClassifier
sk_tree=DecisionTreeClassifier(criterion='entropy',max_depth=5)

In [0]:
sk_tree.fit(X,Y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='entropy',
                       max_depth=5, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [0]:
test_data=pd.read_csv('Test.csv')

In [0]:
test_data_clean=test_data.drop(coulmns_to_drop,axis=1)

In [0]:
test_data_clean["sex"]=le.fit_transform(test_data_clean["sex"])
test_data_clean=test_data_clean.fillna(test_data_clean["age"].mean())

In [0]:
y_pred=sk_tree.predict(test_data_clean[input_cols])

In [0]:
df=pd.DataFrame(data=y_pred,columns=["survived"])
df.to_csv('y_prediction.csv',index=True)